export const FORMREGEX = {
  email: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  username: /^[a-zA-ZàáâäãåąčćęèéêëėįìíîïłńòóôöõøùúûüųūÿýżźñçčšžÀÁÂÄÃÅĄĆČĖĘÈÉÊËÌÍÎÏĮŁŃÒÓÔÖÕØÙÚÛÜŲŪŸÝŻŹÑßÇŒÆČŠŽ∂ð ,.'-]+$/u
}

export const FORMERRORMESAGE = {
  required: "Обязательное поле!",
  email: {
    message: "Введите email коректно!"
  },
  username: {
    maxLength: "Максимум 15 символов!",
    minLength: "Минимум 3 символа!",
    pattern: "Введите правильно username!"
  },
  password: {
    maxLength: "Максимум 40 символов!",
    minLength: "Минимум 5 символов!",
  },
  route: {
    minLength: "Минимум один символ!",
    maxLength: "Максимум 20 символов!",
  }
}